import { useState } from 'react'
import { useParams } from 'react-router-dom'

import './product.css'

import productPreview from '../../assets/two-guitars.png'
import productSlider from '../../assets/guitar.png'



function Product(props) {
    const [showMore, setShowMore] = useState(false)
    const { id } = useParams();
    const [product, setProduct] = useState([])
    
  return ( 
    <>
        <div className="product">
            <div className="product-content">
                <div className="product-preview">
                    <img className='product-preview-img' src={productPreview} alt="" />
                </div>
                <div className="product-slider">
                    <div className="product-slide">
                        <img className='img-big' src={productSlider} alt="" />
                    </div>
                </div>

                <div className="product-info">
                    <div className="product-info-title">
                        Kaysen 
                        StratocasterK-EG1 BK
                    </div>
                    <div className="product-info-articul">
                        Артикул:110001
                    </div>
                    <div className="product-info-raiting">
                        <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M16.9708 20.8259C16.5831 21.1328 16.0914 21.0239 15.5052 20.5785L10.5029 16.738L5.49119 20.5785C4.90493 21.0239 4.42267 21.1328 4.02551 20.8259C3.63783 20.5191 3.5527 20.0143 3.78913 19.2917L5.76546 13.135L0.715954 9.33404C0.12957 8.89853 -0.106697 8.44323 0.0445595 7.9483C0.195816 7.47319 0.640266 7.23563 1.36843 7.24551L7.56209 7.28512L9.44382 1.09868C9.67076 0.366199 10.0112 0 10.5029 0C10.9851 0 11.3256 0.366199 11.5525 1.09868L13.4343 7.28512L19.628 7.24551C20.3561 7.23563 20.8005 7.47319 20.9518 7.9483C21.1126 8.44323 20.8667 8.89853 20.2804 9.33404L15.2309 13.135L17.2072 19.2917C17.4436 20.0143 17.3585 20.5191 16.9708 20.8259Z" fill="#FED980"/>
                        </svg>
                        <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M16.9708 20.8259C16.5831 21.1328 16.0914 21.0239 15.5052 20.5785L10.5029 16.738L5.49119 20.5785C4.90493 21.0239 4.42267 21.1328 4.02551 20.8259C3.63783 20.5191 3.5527 20.0143 3.78913 19.2917L5.76546 13.135L0.715954 9.33404C0.12957 8.89853 -0.106697 8.44323 0.0445595 7.9483C0.195816 7.47319 0.640266 7.23563 1.36843 7.24551L7.56209 7.28512L9.44382 1.09868C9.67076 0.366199 10.0112 0 10.5029 0C10.9851 0 11.3256 0.366199 11.5525 1.09868L13.4343 7.28512L19.628 7.24551C20.3561 7.23563 20.8005 7.47319 20.9518 7.9483C21.1126 8.44323 20.8667 8.89853 20.2804 9.33404L15.2309 13.135L17.2072 19.2917C17.4436 20.0143 17.3585 20.5191 16.9708 20.8259Z" fill="#FED980"/>
                        </svg>
                        <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M16.9708 20.8259C16.5831 21.1328 16.0914 21.0239 15.5052 20.5785L10.5029 16.738L5.49119 20.5785C4.90493 21.0239 4.42267 21.1328 4.02551 20.8259C3.63783 20.5191 3.5527 20.0143 3.78913 19.2917L5.76546 13.135L0.715954 9.33404C0.12957 8.89853 -0.106697 8.44323 0.0445595 7.9483C0.195816 7.47319 0.640266 7.23563 1.36843 7.24551L7.56209 7.28512L9.44382 1.09868C9.67076 0.366199 10.0112 0 10.5029 0C10.9851 0 11.3256 0.366199 11.5525 1.09868L13.4343 7.28512L19.628 7.24551C20.3561 7.23563 20.8005 7.47319 20.9518 7.9483C21.1126 8.44323 20.8667 8.89853 20.2804 9.33404L15.2309 13.135L17.2072 19.2917C17.4436 20.0143 17.3585 20.5191 16.9708 20.8259Z" fill="#FED980"/>
                        </svg>
                        <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M16.9708 20.8259C16.5831 21.1328 16.0914 21.0239 15.5052 20.5785L10.5029 16.738L5.49119 20.5785C4.90493 21.0239 4.42267 21.1328 4.02551 20.8259C3.63783 20.5191 3.5527 20.0143 3.78913 19.2917L5.76546 13.135L0.715954 9.33404C0.12957 8.89853 -0.106697 8.44323 0.0445595 7.9483C0.195816 7.47319 0.640266 7.23563 1.36843 7.24551L7.56209 7.28512L9.44382 1.09868C9.67076 0.366199 10.0112 0 10.5029 0C10.9851 0 11.3256 0.366199 11.5525 1.09868L13.4343 7.28512L19.628 7.24551C20.3561 7.23563 20.8005 7.47319 20.9518 7.9483C21.1126 8.44323 20.8667 8.89853 20.2804 9.33404L15.2309 13.135L17.2072 19.2917C17.4436 20.0143 17.3585 20.5191 16.9708 20.8259Z" fill="#FED980"/>
                        </svg>
                        <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M16.9708 20.8259C16.5831 21.1328 16.0914 21.0239 15.5052 20.5785L10.5029 16.738L5.49119 20.5785C4.90493 21.0239 4.42267 21.1328 4.02551 20.8259C3.63783 20.5191 3.5527 20.0143 3.78913 19.2917L5.76546 13.135L0.715954 9.33404C0.12957 8.89853 -0.106697 8.44323 0.0445595 7.9483C0.195816 7.47319 0.640266 7.23563 1.36843 7.24551L7.56209 7.28512L9.44382 1.09868C9.67076 0.366199 10.0112 0 10.5029 0C10.9851 0 11.3256 0.366199 11.5525 1.09868L13.4343 7.28512L19.628 7.24551C20.3561 7.23563 20.8005 7.47319 20.9518 7.9483C21.1126 8.44323 20.8667 8.89853 20.2804 9.33404L15.2309 13.135L17.2072 19.2917C17.4436 20.0143 17.3585 20.5191 16.9708 20.8259Z" fill="#FED980"/>
                        </svg>
                    </div>
                    <div className="product-info-price">
                        11 500 сом
                    </div>
                    <div className="product-info-handler">
                        <svg width="34" height="31" viewBox="0 0 34 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M9.96745 0.666748C4.56035 0.666748 0.332031 5.36644 0.332031 10.9267C0.332031 13.8186 0.794829 16.2 2.52008 18.7058C4.1662 21.0967 6.90354 23.5095 11.1509 26.6926L16.9987 30.6667L22.846 26.693C27.0936 23.5097 29.8311 21.0968 31.4773 18.7058C33.2026 16.2 33.6654 13.8186 33.6654 10.9267C33.6654 5.36644 29.437 0.666751 24.03 0.666751C21.3169 0.666751 18.9684 1.77209 16.9987 3.77213C15.029 1.77209 12.6805 0.666748 9.96745 0.666748ZM9.96745 4.00008C6.62455 4.00008 3.66536 6.97591 3.66536 10.9267C3.66536 11.8416 3.71715 12.6459 3.84624 13.3876C4.06247 14.6301 4.4956 15.6972 5.26559 16.8155C6.57423 18.7162 8.91304 20.85 13.1513 24.0263L16.9987 26.9157L20.8461 24.0263C25.0844 20.85 27.4232 18.7162 28.7318 16.8155C29.9615 15.0295 30.332 13.3742 30.332 10.9267C30.332 6.97591 27.3729 4.00008 24.03 4.00008C21.9705 4.00008 20.0822 4.9772 18.3376 7.33059C18.0232 7.75464 17.5266 8.0047 16.9987 8.0047C16.4708 8.0047 15.9742 7.75464 15.6598 7.33059C13.9152 4.9772 12.0269 4.00008 9.96745 4.00008Z" fill="black"/>
                        </svg>
                        <button className="product-info-btn">В КОРЗИНУ</button>
                    </div>
                    <div onClick={() => setShowMore((prev) => !prev)} className="product-info-show-more">
                       {showMore ?  'Скрыть характеристику' : 'Смотреть характеристику'}
                    </div>
                </div>
            </div>
            {showMore && (<div className="product-more">
                <div className="product-more-th">
                    <td>Производитель</td>
                    <td>Kaysen</td>
                </div>
                <div className="product-more-th">
                    <td>Конструкция грифа</td>
                    <td>На болтах</td>
                </div>
                <div className="product-more-th">
                    <td>Количество струн</td>
                    <td>6</td>
                </div>
                <div className="product-more-th">
                    <td>Цвет</td>
                    <td>Черный</td>
                </div>
                <div className="product-more-th">
                    <td>Форма корпуса</td>
                    <td>Stratocaster</td>
                </div>
                <div className="product-more-th">
                    <td>Состояние</td>
                    <td>Новое</td>
                </div>
                <div className="product-more-th">
                    <td>Количество ладов</td>
                    <td>22</td>
                </div>
                <div className="product-more-th">
                    <td>Корпус гитары</td>
                    <td>Липа</td>
                </div>
                <div className="product-more-th">
                    <td>Гриф</td>
                    <td>Липа</td>
                </div>
                <div className="product-more-th">
                    <td>Накладка грифа</td>
                    <td>Палисандр</td>
                </div>
                <div className="product-more-th">
                    <td>Мензура гитары</td>
                    <td>25.5”</td>
                </div>
                <div className="product-more-th">
                    <td>Левосторонняя гитара</td>
                    <td>Нет</td>
                </div>
                <div className="product-more-th product-more-th-title">
                    <td>Колки</td>
                    <td></td>
                </div>
                <div className="product-more-th">
                    <td>Колковый механизм</td>
                    <td>Хромированное литье</td>
                </div>
                <div className="product-more-th product-more-th-title">
                    <td>Звукосниматели</td>
                    <td></td>
                </div>
                <div className="product-more-th">
                    <td>Тип звукоснимателей</td>
                    <td>S-S-S</td>
                </div>
                <div className="product-more-th product-more-th-title">
                    <td>Бридж</td>
                    <td></td>
                </div>
                <div className="product-more-th">
                    <td>Тип бриджа</td>
                    <td>Тремоло</td>
                </div>
            </div>)}
        </div>
    </>
  )
}

export default Product;
